---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.Events.ViewActivatingEventArgs
source: html/4807ca42-0b76-8f20-38a4-806bfb8a03cc.htm
---
# ViewActivatingEventArgs Members

When the event is cancellable, may call the Cancel() method to cancel it.